app/controllers/photos_controller.rb

  def create
    photo = Photo.create photo_params
---
INSERT INTO "photos" ("image", "rating", "place_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image", "http://placekitten.com/200/400"], ["rating", "5"], ["place_id", "148"], ["created_at", "2020-12-09 22:32:54.318420"], ["updated_at", "2020-12-09 22:32:54.318420"]]

  def show
    @photo = Place.find params[:id]
---
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 144], ["LIMIT", 1]]

  def edit
    @photo = Photo.find params[:id]
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def update
    photo = Photo.find params[:id]
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 269], ["LIMIT", 1]]

  def destroy
    Photo.destroy params[:id]
---
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 269]]