app/controllers/places_controller.rb

  def create
    Place.create place_params
---
INSERT INTO "places" ("setting", "state", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["setting", "rrr"], ["state", "rrr"], ["address", "Bondi Beach"], ["created_at", "2020-12-10 02:00:22.437637"], ["updated_at", "2020-12-10 02:00:22.437637"]]

  def index
    @places = Place.all
---
SELECT "places".* FROM "places"

  def show
    @place = Place.find params[:id]
---
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]

  def edit
    @place = Place.find params[:id]
---
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 153], ["LIMIT", 1]]

  def update
    place = Place.find params[:id]
    place.update place_params
---
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 153], ["LIMIT", 1]]
UPDATE "places" SET "setting" = $1, "state" = $2, "updated_at" = $3 WHERE "places"."id" = $4  [["setting", "Beach"], ["state", "NSW"], ["updated_at", "2020-12-10 05:29:08.138178"], ["id", 153]]

  def destroy
    Place.destroy params[:id]
---
DELETE FROM "places" WHERE "places"."id" = $1  [["id", 164]]