app/controllers/session_controller.rb

    def create
    # raise 'hell'

      user = User.find_by email: params[:email]

      if user.present? && user.authenticate( params[:password] )
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "luke@ga.co"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE (luke@ga.co) LIMIT $1  [["LIMIT", 1]]