app/views/places/show.html.erb


<% @place.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."place_id" = $1  [["place_id", "153"]]